Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.GroupingTypeEnum Enumeration
 The grouping type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum GroupingTypeEnum
Public Enumeration GroupingTypeEnum
Members
Member name | Value | Description
AUTOMATIC | 0 |  Automatic grouping.
MANUAL | 1 |  Manual grouping.
NO_GROUPING | 2 |  No grouping.
See Also
Reference
Tekla.Structures.Model Namespace